#### Some commands for SQL

Select Statement

To run all the rows and columns we will only show the data selecting the data desired

1. Lets imagine table 1

SELECT * FROM Table1;

In this case the command * will show all rows and all columns, and we are not specifying the values to select so it will show all


2. Inside of the Table 1 lets imagine some columns col1 col2 ... col5

SELECT col1, col2 FROM Table1;

In this case we are only running specific columns inside the table


3. lets imagine that col1 have years between 1990 and 2024

SELECT col1, col2 FROM Table1 WHERE col1<2000

In this case, it will show only the first 2 columns with values below the year 2000


4. Especial code
Different from python language in SQL we wont use != operator we will use instead <>:

SELECT col1, col2 FROM Table1 WHERE col1<>2000    
     
in this case, it will bring all values different from the year 2000

COUNT, DISTINCT, LIMIT

1.
SELECT COUNT(*) FROM Table 1

In this case the count will bring back the number of records or rows in the table

SELECT COUNT(col2) FROM Table1 WHERE col1 = 2010;

In this case it will count all values in col2 that are in the year 2010



2.
SELECT DISTINCT Col2 FROM Table1;

In this case we will remove all the duplicates in the col2

3.
we can mix all of the above

SELECT COUNT(DISTINCT ReleaseYear) FROM Films WHERE ProductionCompany="Warner Bros";

In this case it will bring from the table Films the count of all of the values with the production name "Warner Bros" removing all the duplicates in the column releaseyear


4. 
We can specify like in python when we bring command head(3) in this case we will be using the command limit

Thus, SELECT * FROM Table1 LIMIT 20;

We can also skip some values for the first rows, this way:

SELECT * FROM Table1 LIMIT 20 OFFSET 10;

This way we would be skipping the first 10 rows of data and bringing the next 20

INSERT, UPDATE AND DELETE

To insert data into a table we will use the statement INSERT, is a DML (Data manipulation language statement) for reading and modifying data

INSERT INTO [NAME OF THE TABLE]

<([Columnname1],[Columname2]...)> VALUES ([Value1],[Value2],...)

INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(4, 'Saha', 'Sandip', 'Edmonton', 'CA');

INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(5, 'Doe', 'John', 'Sydney', 'AU'), (6, 'Doe', 'Jane', 'Dhaka', 'BD');



UPDATE[[Tablename] SET[Columnname] = [Value]] > WHERE [Condition].

UPDATE Instructor 
SET city='Markham' 
WHERE ins_id=1;

UPDATE Instructor 
SET city='Dhaka', country='BD' 
WHERE ins_id=4;

SELECT * FROM Instructor;


DELETE FROM [Tablename]  WHERE [Condition].

DELETE FROM instructor
WHERE firstname = 'Hima';

SELECT * FROM Instructor;